[{"model": "admin.logentry", "pk": 1, "fields": {"action_time": "2024-11-11T22:28:03.995Z", "user": 1, "content_type": 7, "object_id": "1", "object_repr": "test", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 2, "fields": {"action_time": "2024-11-11T22:28:16.900Z", "user": 1, "content_type": 8, "object_id": "1", "object_repr": "J.D. is a member of test", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "admin.logentry", "pk": 3, "fields": {"action_time": "2024-11-11T22:39:41.803Z", "user": 1, "content_type": 8, "object_id": "2", "object_repr": "J.D. is a member of Accent A Cappella", "action_flag": 1, "change_message": "[{\"added\": {}}]"}}, {"model": "auth.permission", "pk": 1, "fields": {"name": "Can add log entry", "content_type": 1, "codename": "add_logentry"}}, {"model": "auth.permission", "pk": 2, "fields": {"name": "Can change log entry", "content_type": 1, "codename": "change_logentry"}}, {"model": "auth.permission", "pk": 3, "fields": {"name": "Can delete log entry", "content_type": 1, "codename": "delete_logentry"}}, {"model": "auth.permission", "pk": 4, "fields": {"name": "Can view log entry", "content_type": 1, "codename": "view_logentry"}}, {"model": "auth.permission", "pk": 5, "fields": {"name": "Can add permission", "content_type": 2, "codename": "add_permission"}}, {"model": "auth.permission", "pk": 6, "fields": {"name": "Can change permission", "content_type": 2, "codename": "change_permission"}}, {"model": "auth.permission", "pk": 7, "fields": {"name": "Can delete permission", "content_type": 2, "codename": "delete_permission"}}, {"model": "auth.permission", "pk": 8, "fields": {"name": "Can view permission", "content_type": 2, "codename": "view_permission"}}, {"model": "auth.permission", "pk": 9, "fields": {"name": "Can add group", "content_type": 3, "codename": "add_group"}}, {"model": "auth.permission", "pk": 10, "fields": {"name": "Can change group", "content_type": 3, "codename": "change_group"}}, {"model": "auth.permission", "pk": 11, "fields": {"name": "Can delete group", "content_type": 3, "codename": "delete_group"}}, {"model": "auth.permission", "pk": 12, "fields": {"name": "Can view group", "content_type": 3, "codename": "view_group"}}, {"model": "auth.permission", "pk": 13, "fields": {"name": "Can add user", "content_type": 4, "codename": "add_user"}}, {"model": "auth.permission", "pk": 14, "fields": {"name": "Can change user", "content_type": 4, "codename": "change_user"}}, {"model": "auth.permission", "pk": 15, "fields": {"name": "Can delete user", "content_type": 4, "codename": "delete_user"}}, {"model": "auth.permission", "pk": 16, "fields": {"name": "Can view user", "content_type": 4, "codename": "view_user"}}, {"model": "auth.permission", "pk": 17, "fields": {"name": "Can add content type", "content_type": 5, "codename": "add_contenttype"}}, {"model": "auth.permission", "pk": 18, "fields": {"name": "Can change content type", "content_type": 5, "codename": "change_contenttype"}}, {"model": "auth.permission", "pk": 19, "fields": {"name": "Can delete content type", "content_type": 5, "codename": "delete_contenttype"}}, {"model": "auth.permission", "pk": 20, "fields": {"name": "Can view content type", "content_type": 5, "codename": "view_contenttype"}}, {"model": "auth.permission", "pk": 21, "fields": {"name": "Can add session", "content_type": 6, "codename": "add_session"}}, {"model": "auth.permission", "pk": 22, "fields": {"name": "Can change session", "content_type": 6, "codename": "change_session"}}, {"model": "auth.permission", "pk": 23, "fields": {"name": "Can delete session", "content_type": 6, "codename": "delete_session"}}, {"model": "auth.permission", "pk": 24, "fields": {"name": "Can view session", "content_type": 6, "codename": "view_session"}}, {"model": "auth.permission", "pk": 25, "fields": {"name": "Can add club", "content_type": 7, "codename": "add_club"}}, {"model": "auth.permission", "pk": 26, "fields": {"name": "Can change club", "content_type": 7, "codename": "change_club"}}, {"model": "auth.permission", "pk": 27, "fields": {"name": "Can delete club", "content_type": 7, "codename": "delete_club"}}, {"model": "auth.permission", "pk": 28, "fields": {"name": "Can view club", "content_type": 7, "codename": "view_club"}}, {"model": "auth.permission", "pk": 29, "fields": {"name": "Can add membership", "content_type": 8, "codename": "add_membership"}}, {"model": "auth.permission", "pk": 30, "fields": {"name": "Can change membership", "content_type": 8, "codename": "change_membership"}}, {"model": "auth.permission", "pk": 31, "fields": {"name": "Can delete membership", "content_type": 8, "codename": "delete_membership"}}, {"model": "auth.permission", "pk": 32, "fields": {"name": "Can view membership", "content_type": 8, "codename": "view_membership"}}, {"model": "auth.user", "pk": 1, "fields": {"password": "pbkdf2_sha256$870000$b0p74gkbCwLjU4Xjswhkbx$1/tDBOd3Y/MBDv9o25BRQBzRQIMs0RaUSYsXEyiv26s=", "last_login": "2024-11-11T22:27:48.412Z", "is_superuser": true, "username": "J.D.", "first_name": "", "last_name": "", "email": "shumillajd@hotmail.com", "is_staff": true, "is_active": true, "date_joined": "2024-11-11T22:27:27.595Z", "groups": [], "user_permissions": []}}, {"model": "contenttypes.contenttype", "pk": 1, "fields": {"app_label": "admin", "model": "logentry"}}, {"model": "contenttypes.contenttype", "pk": 2, "fields": {"app_label": "auth", "model": "permission"}}, {"model": "contenttypes.contenttype", "pk": 3, "fields": {"app_label": "auth", "model": "group"}}, {"model": "contenttypes.contenttype", "pk": 4, "fields": {"app_label": "auth", "model": "user"}}, {"model": "contenttypes.contenttype", "pk": 5, "fields": {"app_label": "contenttypes", "model": "contenttype"}}, {"model": "contenttypes.contenttype", "pk": 6, "fields": {"app_label": "sessions", "model": "session"}}, {"model": "contenttypes.contenttype", "pk": 7, "fields": {"app_label": "members", "model": "club"}}, {"model": "contenttypes.contenttype", "pk": 8, "fields": {"app_label": "members", "model": "membership"}}, {"model": "sessions.session", "pk": "ldlpssd5kp23jqiwj9emwjm4qorahwvd", "fields": {"session_data": ".eJxVjMEOwiAQRP-FsyGFLgU8eu83kIVdpGpoUtqT8d9tkx70NMm8N_MWAbe1hK3xEiYSV6HE5beLmJ5cD0APrPdZprmuyxTlociTNjnOxK_b6f4dFGxlXxsPnRqMImBLhASWDe-pe-e9Ic9Zo0LjE1DUGSin3rIC1xENLoMRny_wjjh2:1tAcsu:WFwIEH5cWSg0c6zfEvaa9gWMiMA3DxseZfbelWbfBQk", "expire_date": "2024-11-25T22:27:48.416Z"}}, {"model": "members.club", "pk": 1, "fields": {"club_name": "test", "club_desc": "x"}}, {"model": "members.club", "pk": 2, "fields": {"club_name": "360BHM", "club_desc": "The purpose of the 360BHM is to this series seeks to educate, enhance, and entertain the university and Gainesville communities by reflecting on the contributions that Black Americans have made. It is our goal to advocate exposure of refined enrichment inspired by the heritage and legacy of universal Black culture."}}, {"model": "members.club", "pk": 3, "fields": {"club_name": "3D Printing Club", "club_desc": "The 3D Printing Club is established for the purpose of educating UF students on the world of 3D printing and how 3D printing and related skills can be used within their education, professionally, and leisurely. Additionally, projects will be set in place to address issues seen within the University of Florida, the local Gainesville area, and nationally."}}, {"model": "members.club", "pk": 4, "fields": {"club_name": "A Private Inn", "club_desc": "A Private Inn is affiliated with the University of Florida, dedicated to promoting mystery and detective fiction enthusiasts. The purpose of \"A Private Inn, Mystery Club\" is to create a vibrant and welcoming community for students who share a keen interest in mystery, detective fiction, and puzzle-solving. Our primary goal is to provide a platform where members can engage in intellectual discussions, collaborative mystery-solving activities, and exploration of detective literature. As an affiliate of University..."}}, {"model": "members.club", "pk": 5, "fields": {"club_name": "A Reason to Give", "club_desc": "Our goal is to help serve the homeless population in Gainesville by providing weekly lunches!"}}, {"model": "members.club", "pk": 6, "fields": {"club_name": "Academy of Managed Care Pharmacy", "club_desc": "To support and introduce national AMCP into the University of Florida and to give students a greater opportunity to learn about an growing area of pharmacy."}}, {"model": "members.club", "pk": 7, "fields": {"club_name": "Accent A Cappella", "club_desc": "Accent A Cappella (formerly known as No Southern Accent) is the University of Florida's premier all-gender a cappella group founded in 2001. We actively compete in the International Championship of Collegiate A Cappella (Quarterfinal Champions 2024, Quarterfinal Champions 2023, Semi-Final 3rd Place 2023, Quarterfinal Champions 2022), SoJam Festival (First Place 2022), BOSS Sings Festival (Second Place 2024), and travel for performances and gigs all around the country! Recently, we recorded our newest studio album ôBefore..."}}, {"model": "members.club", "pk": 8, "fields": {"club_name": "Adaa", "club_desc": "The purpose of Adaa is to display Indian culture through a fusion of Bollywood, contemporary, and classical dancing. Adaa is a place where those judgments fall silent. The team is focused on being the best it can and putting in the effort to grow. We donÆt seek experienced dancers with advanced skills, but rather we seek diligent and dedicated hearts."}}, {"model": "members.club", "pk": 9, "fields": {"club_name": "Adventist Christian Fellowship", "club_desc": "Adventist Christian Fellowship is established for the purpose of representing the love of Jesus Christ. As a Christian Organization, we seek to spread the Advent Message and share the love of Jesus Christ to all those willing to receive it through open campus activities, Bible discussion, and other unique forms of fellowship. We show no preference or privilege on the basis of race, gender, sexual orientation or religious background."}}, {"model": "members.club", "pk": 10, "fields": {"club_name": "Advertising Society", "club_desc": "Ad Society is the advertising student organization at the University of Florida. Open to all majors, Ad Society holds general body meetings with guest speakers from the industry, takes trips to visit advertising agencies in various cities, and hosts workshops for students professional improvement."}}, {"model": "members.club", "pk": 11, "fields": {"club_name": "advnt", "club_desc": "advnt is a student-run annual advertising portfolio publication. This organization prepares the creatively inclined for advertising careers in copywriting, illustration, graphic design, art direction, production, project management, and web design. We welcome anyone of any major, who is ready to join our creatives creating creativity, to apply."}}, {"model": "members.club", "pk": 12, "fields": {"club_name": "AeroGator", "club_desc": "AeroGator is established for the purpose of providing students the opportunity to develop the skills needed to excel in the aerospace industry. This is done by pursuing an aircraft design project and applying skills learned in the classroom to real life applications. The teamÆs goals include being capable of optimizing aircraft performance, functioning in a fluid group dynamic, providing opportunities to learn new skills, and promoting confidence within incoming engineers to excel in their future..."}}, {"model": "members.club", "pk": 13, "fields": {"club_name": "African Student Union", "club_desc": "We, the African Student Union (ASU) have hereby founded this organization to support and unite African students and to promote awareness of African issues and culture to all students and the Gainesville community."}}, {"model": "members.club", "pk": 14, "fields": {"club_name": "Agricultural and Life Sciences College Council", "club_desc": "Provide leadership for CALS students and student organizations."}}, {"model": "members.club", "pk": 15, "fields": {"club_name": "Agricultural Economics Club", "club_desc": "To promote interest in the field of agricultural and applied economics; including but not limited to agrimarketing, agribusiness and natural resource and environmental economics. b. To develop a relationship between students and faculty of the Food and Resource Economics Department (FRED) that will further awareness about agricultural and resource economics. c. To provide a liaison between club members and industry professionals and provide a forum to exchange ideas. d. To provide opportunity for development of..."}}, {"model": "members.club", "pk": 16, "fields": {"club_name": "Agricultural Education and Communications Graduate Student Association", "club_desc": "It shall be the purpose of this organization to further the education and interest of its members in Agricultural Education and Communication (AEC) and its related fields at the University of Florida (UF)."}}, {"model": "members.club", "pk": 17, "fields": {"club_name": "Agricultural Operations Management Club", "club_desc": "The purpose of the Agricultural Operations Management Club is to acquaint present and potential members with opportunities in Agricultural Operations Management, to acquaint industry and the general public with Agricultural Operations Management, to develop leadership potential and create a spirit of fellowship among members, to foster the development of professional attitudes, to encourage recognition of the need for continued professional and intellectual improvement, to promote the interests of students in Agricultural Operations Management as these..."}}, {"model": "members.club", "pk": 18, "fields": {"club_name": "AI in Healthcare Club", "club_desc": "The purpose of the AI in Healthcare Club is to foster a collaborative and innovative community of students passionate about the intersection of artificial intelligence and healthcare. Our mission is to explore, discuss, and apply AI technologies to address the unique challenges and opportunities in the healthcare industry. Through educational events, hands-on workshops, and meaningful collaborations, we aim to empower our members with the knowledge and skills needed to contribute to the advancement of healthcare..."}}, {"model": "members.club", "pk": 19, "fields": {"club_name": "Alagarto Printmaking Guild", "club_desc": "Our purpose is to help promote and spread the ideas and processes of printmaking."}}, {"model": "members.club", "pk": 20, "fields": {"club_name": "Albanian Student Association", "club_desc": "To promote awareness about the history, culture, and traditions of the beautiful country of Albania."}}, {"model": "members.club", "pk": 21, "fields": {"club_name": "Alexander Hamilton Society", "club_desc": "The primary purpose of this organization is to identify, educate, and launch students into foreign policy and national security careers with the Hamiltonian perspective of strong and principled American leadership in global affairs. These goals shall be achieved through club-sponsored activities, including, but not limited to, engaging peers in debates organized between distinguished scholars and practitioners with local faculty on foreign, defense and economic policy to bring a fresh perspective to campus. We aim to..."}}, {"model": "members.club", "pk": 22, "fields": {"club_name": "Ally-Gator (Dental Gay-Straight Alliance)", "club_desc": "College of Dentistry's Ally-Gator is a student run organization that celebrates diversity and equality among our college and our patients. Ally-Gator is committed to providing a supportive and cooperative environment for students, faculty, staff, and patients both within the college and beyond. The organization's main goal is to provide support and promote equality for the LGBTQ+ community and its allies."}}, {"model": "members.club", "pk": 23, "fields": {"club_name": "ALPHA CHI OMEGA", "club_desc": "The Alpha Chi Omega Fraternity is devoted to enriching the lives of members through lifetime opportunities of friendship, leadership, learning and service."}}, {"model": "members.club", "pk": 24, "fields": {"club_name": "ALPHA DELTA PI", "club_desc": "Established in 1851, Alpha Delta Pi is committed to sisterhood, values and ethics, high academic standards and social responsibility."}}, {"model": "members.club", "pk": 25, "fields": {"club_name": "Alpha Epsilon Delta", "club_desc": "Alpha Epsilon Delta (Florida Alpha Chapter) is a respected organization and the most renowned chapter in the U.S. We are a pre-professional honor society dedicated to providing unique community service opportunities and guidance throughout the undergraduate process. AED participates in over 100 projects each year in affiliation with the Climb for Cancer Foundation, Florida Diabetes Camp, Alachua County Health Department, Shands Hospital, Alachua County Humane Society, and St. Jude Children's Research Hospital to name..."}}, {"model": "members.club", "pk": 26, "fields": {"club_name": "Alpha Epsilon Lambda (AEL)", "club_desc": "The Alpha Chapter of AEL has been founded to recognize, promote, and foster outstanding leadership, academic achievement, and service among graduate and professional students; and to encourage and support the development of all graduate and professional student organizations at the University of Florida."}}, {"model": "members.club", "pk": 27, "fields": {"club_name": "ALPHA EPSILON PHI", "club_desc": "The mission of Alpha Epsilon Phi Sorority is to inspire and support exemplary women dedicated to friendship and a lifelong commitment to Alpha Epsilon Phi while building on the vision of our founders. The Alpha Tau chapter at the University of Florida lives by its motto \"Multa Corda, Una Casa\" or \"Many Hearts, One Purpose.\""}}, {"model": "members.club", "pk": 28, "fields": {"club_name": "ALPHA EPSILON PI", "club_desc": "Throughout our history, the fraternity setting has served as a ôlearning laboratoryö, a testing ground for young men who later become leaders in business, education, government, religion, and science. A goal of our fraternity is to help each student to develop character, to learn responsibility, and to develop a proper set of values through living together in brotherhood. Alpha Epsilon Pi prepares young men for their role in life as responsible citizens."}}, {"model": "members.club", "pk": 29, "fields": {"club_name": "ALPHA GAMMA RHO", "club_desc": "The purpose of Alpha Gamma Rho: To make better men and through them a broader and better agriculture by surrounding our member with influences intending to encourage individual endeavor, resourcefulness, and aggressive effort; along lines making for the development of better mental, social, moral, and physical qualities; To promote a wider acquaintance and broader outlook on the part of agricultural men through fellowship in a national organization that stands for the best social, mental, and..."}}, {"model": "members.club", "pk": 30, "fields": {"club_name": "ALPHA KAPPA ALPHA", "club_desc": "The purpose of Alpha Kappa Alpha Sorority is to cultivate and encourage high scholastic and ethical standards, to promote unity and friendship among college women, to study and help alleviate problems concerning girls and women in order to improve their social stature, to maintain a progressive interest in college life, and to be of service to all mankind."}}, {"model": "members.club", "pk": 31, "fields": {"club_name": "alpha KAPPA DELTA PHI", "club_desc": "The sisterhood of alpha Kappa Delta Phi provides women with a sense of belonging that nurtures life-long friendships, develops self-empowered leaders, and strengthens communities through service, scholarship, and Asian-Awareness."}}, {"model": "members.club", "pk": 32, "fields": {"club_name": "Alpha Kappa Psi", "club_desc": "Alpha Kappa Psi is the oldest and largest co-ed professional business fraternity in the nation. Alpha Kappa Psi is the premier developer of principled business leaders."}}, {"model": "members.club", "pk": 33, "fields": {"club_name": "Alpha Omega", "club_desc": "Loving God, Loving People"}}, {"model": "members.club", "pk": 34, "fields": {"club_name": "Alpha Omega - Jewish Dental Society", "club_desc": "Section 1 û Mission Statement To enhance the dental profession and lives of dental professionals worldwide by promoting and supporting ideals of global oral health, education, and the bonds of fraternity."}}, {"model": "members.club", "pk": 35, "fields": {"club_name": "ALPHA OMICRON PI", "club_desc": "At AOII, our mission is to promote lifelong friendship, inspire academic excellence, to lead by example, and to serve our campus and surrounding communities. The values on which AOII was founded help lead us in the decisions we make and the behaviors we exhibit in our daily lives. The object of our Fraternity, written by our Founders in 1897, inspires us to stand at all times for character, dignity, scholarship, and college loyalty. These values..."}}, {"model": "members.club", "pk": 36, "fields": {"club_name": "ALPHA PHI", "club_desc": "Alpha Phi is a loyal sisterhood of women courageously pursuing limitless excellence. The purpose of this organization is the promotion of growth in character, of unity, of feeling, of sisterly affection, and of social communion among its members. Alpha Phi International Fraternity is more than just a Greek organizationùit's a community of empowered women supporting one another for a lifetime."}}, {"model": "members.club", "pk": 37, "fields": {"club_name": "ALPHA PHI ALPHA", "club_desc": "Alpha Phi Alpha Fraternity, Inc. develops leaders, promotes brotherhood and academic excellence, while providing service and advocacy for our communities. As men of Alpha Phi Alpha, we hold ourselves to high standards through manly deeds, scholarship and love for all mankind."}}, {"model": "members.club", "pk": 38, "fields": {"club_name": "ALPHA TAU OMEGA", "club_desc": "To build well-rounded men devoted to the University and the Gainesville community."}}, {"model": "members.club", "pk": 39, "fields": {"club_name": "Alpha Zeta", "club_desc": "Alpha Zeta is an honorary, professional society for students and industry professionals in the agriculture and natural resources fields. Today, Alpha Zeta has more than 115,000 alumni and more than 3,000 student members at 74 universities. We take pride in our commitment to the highest levels of scholarship, leadership, fellowship, and character. The Florida Chapter of Alpha Zeta is only available to students in the College of Agricultural and Life Sciences with a GPA in..."}}, {"model": "members.club", "pk": 40, "fields": {"club_name": "American Association for Aerosol Research-student chapter", "club_desc": "As a student chapter of AAAR in UF, the organization intends to promote interest in aerosol research by hosting professional events such as student run seminars, lab tours, etc., and social events to promote various aspects of aerosol research. Gaining up-to-date knowledge through organizational activities, the members will develop interest in pursuing higher education and career in the field of aerosol science. The organization also serves as a platform to build professional network with aerosol..."}}, {"model": "members.club", "pk": 41, "fields": {"club_name": "American Association for Dental, Oral, and Craniofacial Research Student Research Group Florida Chapter", "club_desc": "We are an organization that focuses on promoting the importance of dental research and the involvement of student research in dentistry."}}, {"model": "members.club", "pk": 42, "fields": {"club_name": "American Association of Public Health Dentistry", "club_desc": "To work and ultimately function as a student chapter of its national organization at the University of Florida. AAPHD wants to promote community and civic involvement, and develop leadership skills that foster a collaborative learning environment. The goals of AAPHD are to advocate for oral health, fight against health disparities and uplift communities through student participation in continuing education classes, community events, social events, and professional networking."}}, {"model": "members.club", "pk": 43, "fields": {"club_name": "American Association of Women Dentists", "club_desc": "To have an organization that is closely affiliated with both the University of Florida û College of Dentistry and the female community of organized dentistry at large, the national chapter of AAWD. We aim to allow female students to become more involved in an organization related to dentistry. Males are welcome to serve as auxiliary members. Students are able to interact with dentists and learn more about the field of dentistry."}}, {"model": "members.club", "pk": 44, "fields": {"club_name": "American Cancer Society on Campus", "club_desc": "ACSOC hopes to connect the University of Florida's student body to the values of the American Cancer Society to improve the lives of people with cancer and their families by spreading awareness about cancer prevention and treatment, providing support and resources to cancer patients and their families, and raising funds for cancer research"}}, {"model": "members.club", "pk": 45, "fields": {"club_name": "American College of Clinical Pharmacy", "club_desc": "The purpose of the American College of Clinical Pharmacy is to explore and promote careers in clinical pharmacy and provide ways to practice the essential skills needed in clinical pharmacy careers."}}, {"model": "members.club", "pk": 46, "fields": {"club_name": "American College of Clinical Pharmacy Jacksonville", "club_desc": "The purpose of the American College of Clinical Pharmacy is to explore and promote careers in clinical pharmacy and provide ways to practice the essential skills needed in clinical pharmacy careers."}}, {"model": "members.club", "pk": 47, "fields": {"club_name": "American Concrete Institute", "club_desc": "The purpose of the American Concrete Institute shall be to further education and technical practice, scientific investigation, and research by organizing the efforts of its members for a nonprofit, public service in gathering, correlating, and disseminating information for the improvement of the design, construction, manufacture, use, and maintenance of concrete products and structures. This American Concrete Institute is accordingly organized and shall be operated exclusively for educational and scientific purposes."}}, {"model": "members.club", "pk": 48, "fields": {"club_name": "American Institute of Aeronautics and Astronautics", "club_desc": "The American Institute of Aeronautics and Astronautics is a student organization within the University of Florida that offers students the opportunity to enhance their education and experience through design teams, social activities, community service, tutoring and mentoring, speakers, company tours, regional council meetings, and national conferences and competitions. We aim to provide students with exposure to speakers û professors, student interns, and professionals from all facets of industry û and to connect students with research,..."}}, {"model": "members.club", "pk": 49, "fields": {"club_name": "American Institute of Architecture Students", "club_desc": "The purpose of AIAS is to promote excellence in architecture education, training, and practice, to foster an appreciation of architecture and related disciplines, to enrich communities in a spirit of collaboration, and to organize students and combine their efforts to advance the art and science of architecture."}}, {"model": "members.club", "pk": 50, "fields": {"club_name": "American Institute of Chemical Engineers", "club_desc": "The University of Florida Chapter of the American Institute of Chemical Engineers also known as UF AIChE is a student-run, non-profit organization that strives to provide fellowship among chemical engineering students and also foster engineering skills and professional development for the continued advancement of ourselves, our University, our community, and our world."}}, {"model": "members.club", "pk": 51, "fields": {"club_name": "American Marketing Association", "club_desc": "As a premier and professional organization within the prestigious Warrington College of Business, the University of Florida Collegiate Chapter of the American Marketing Association prides itself on the personal and professional development of its members. We strive to bridge the gap between classroom instruction and real-world business experience, by providing a medium for students to interact with professionals in the industry, develop tangible marketing skills, and engage with like-minded individuals in a creative atmosphere."}}, {"model": "members.club", "pk": 52, "fields": {"club_name": "American Meteorological Society", "club_desc": "The purpose of AMS Gator Chapter is to create an extracurricular engagement and networking space for students and faculty focused on meteorology. We connect students with opportunities and contacts on and off campus to help foster their interest and future paths in meteorology. Overall, we strive to make meteorology at UF exciting and engaging with social events and projects."}}, {"model": "members.club", "pk": 53, "fields": {"club_name": "American Nuclear Society", "club_desc": "The objectives of the Section shall be consistent with the objectives of the Society as set forth in its Certificate of Incorporation and in Article B2 of its Bylaws and Rules, principally, \"the advancement of science and engineering relating to the atomic nucleus, and of allied sciences and arts.\""}}, {"model": "members.club", "pk": 54, "fields": {"club_name": "American Pharmacists Association - Academy of Student Pharmacists - Gainesville", "club_desc": "The American Pharmacists Association- Academy of Student Pharmacists (APhA-ASP) is the largest professional student pharmacy organization in the nation. APhA-ASP is the only organization representing all pharmacists and student pharmacists. The purpose of APhA-ASP is to be the collective voice of student pharmacists, to provide opportunities for professional growth, to improve patient care, and to envision and advance the future of pharmacy."}}, {"model": "members.club", "pk": 55, "fields": {"club_name": "American Pharmacists Association - Academy of Student Pharmacists - Jacksonville", "club_desc": "The mission of APhA-ASP is to be the collective voice of student pharmacists, to provide opportunities for professional growth, to improve patient care and to envision and advance the future of pharmacy."}}, {"model": "members.club", "pk": 56, "fields": {"club_name": "American Pharmacists Association - Academy of Student Pharmacists-Orlando Campus", "club_desc": "To be the collective voice of student pharmacists, to provide opportunities for professional growth, to improve patient care, and to envision and advance the future of pharmacy."}}, {"model": "members.club", "pk": 57, "fields": {"club_name": "American Physician Scientists Association", "club_desc": "The purpose of the undergraduate APSA Chapter at UF is to facilitate the career development of students who wish to train as physician-scientists or as other research-oriented health professionals. Website: https://apsa-ufl.org/ Find all relevant links here: https://linktr.ee/UFAPSA"}}, {"model": "members.club", "pk": 58, "fields": {"club_name": "American Society for Microbiology, Student Chapter", "club_desc": "The American Society for Microbiology, UF Student Chapter is a student-run organization that offers undergraduate and graduate students an opportunity to more fully explore the microbiology field by offering ties to research, leadership opportunities, relevant outreach programs, trips to microbiology-related institutions, and connections with fellow peers and faculty members."}}, {"model": "members.club", "pk": 59, "fields": {"club_name": "American Society of Biomechanics", "club_desc": "The purpose of the American Society of Biomechanics chapter is to foster the advancement, communication, and application of biomechanics to benefit society."}}, {"model": "members.club", "pk": 60, "fields": {"club_name": "American Society of Civil Engineers", "club_desc": "The American Society of Civil Engineers develops future leaders in civil and environmental engineering by promoting professionalism and technical development while providing a sense of community for students."}}, {"model": "members.club", "pk": 61, "fields": {"club_name": "American Society of Consultant Pharmacists", "club_desc": "The purpose of the American Society of Consultant Pharmacists is to further disseminate knowledge and information about the profession of consultant and senior care pharmacy and to play an integral part in carrying out the mission and specific goals of the national chapter of the American Society of Consultant Pharmacists."}}, {"model": "members.club", "pk": 62, "fields": {"club_name": "Architrave", "club_desc": "Architrave is a student-run publication within the college of Design, Construction, and Planning that showcases the student work and student life by means of collecting guest lecture interviews, travel photos, student writings, and design work."}}, {"model": "members.club", "pk": 63, "fields": {"club_name": "Argentine Student Association", "club_desc": "The purpose of ARSA is to accomplish the following: A. Promote the increased awareness of the shared culture between Argentineans and the rest of the Latin American nations. B. Educate the Student Body on the history and cultural richness of the Argentine nation. C. Support the regained cultural identity for Argentinean students and all interested students. D. Inspire future Argentinean and interested leaders. E. Unite all Latin nations behind common programming."}}, {"model": "members.club", "pk": 64, "fields": {"club_name": "Argentine Tango Club", "club_desc": "Argentine Tango Club consists of students, faculty and staff from the University of Florida and community members from Gainesville. The purpose of the club is to provide a venue within the campus for learning, practicing, and enjoying the Argentine Tango. Our group is a non-profit student-run organization and we offer free lessons for UF students. We also perform at local dance shows and fund-raising activities."}}, {"model": "members.club", "pk": 65, "fields": {"club_name": "Army Fightin' Gator Student Association", "club_desc": "The purpose of Army FightinÆ Gator Student Association is to educate, develop, and inspire UF students to enhance their leadership development with military principles"}}, {"model": "members.club", "pk": 66, "fields": {"club_name": "Art History Association", "club_desc": "\"We are a club for anyone and everyone who is passionate about art, history, and art history. Our goal is to create a community for art lovers and provide opportunities for networking, making friends, and having fun.\""}}, {"model": "members.club", "pk": 67, "fields": {"club_name": "Artificial Intelligence and Data Analytics", "club_desc": "The purpose of this club is to foster an inclusive environment for like-minded people with an interest in Artificial Intelligence and Data Analytics in the Business atmosphere. Anyone who is willing to learn and participate is welcome to be a part of our organization. In this inclusive environment, we value respecting others, free-thinking, and passion. The goal of this club is to promote educational material with a preference in AI and data analytics trying to..."}}, {"model": "members.club", "pk": 68, "fields": {"club_name": "Arts in Health", "club_desc": "The purpose of Arts in Health is to bring artistic skills to people around the world, to use those skills to enhance individual and community health, and to create opportunities for international and cultural exchange."}}, {"model": "members.club", "pk": 69, "fields": {"club_name": "AscenDance Salsa Company", "club_desc": "The purpose of AscenDance Salsa Company is to provide a safe and supportive environment for participants to learn the skills and technique of various styles of Latin dancing, including, but not limited to, Casino Salsa, On 1 Salsa, On 2 Salsa, and Bachata. AscenDance Salsa Company also provides performance opportunities for students on campus and at nearby dance studios. While our classes will be more focused on technique and detail, we will also host..."}}, {"model": "members.club", "pk": 70, "fields": {"club_name": "Asian American Student Union", "club_desc": "The Asian American Student Union seeks to promote Asian and Asian American Awareness at the University of Florida. We are dedicated to educating the campus about Asian American issues, history, and culture through creative and stimulating events. In addition, AASU strives to be the premier source or political and social advocacy. Lastly we intend to foster dedicated, educated and well-rounded members who apply their unique talents for the greater benefit of the global/social community."}}, {"model": "members.club", "pk": 71, "fields": {"club_name": "Asian and Pacific American Law Students Association", "club_desc": "APALSA was established to help create a support system for individuals of Asian and Pacific Islander descent who are interested in pursuing a legal career. APALSA hopes to attract and encourage students to attend UF Law through efforts of support, networking, and providing an informative database about the Gainesville area."}}, {"model": "members.club", "pk": 72, "fields": {"club_name": "Asian Business Student Association", "club_desc": "The Asian Business Student Association is an Asian-interest, but not Asian-exclusive, business organization that provides students with a community and tools to succeed at the University of Florida and beyond. Our mission is to empower and develop students professionally and personally in a supportive, and safe environment through networking, mentorship, public service, cultural involvement, and more!"}}, {"model": "members.club", "pk": 73, "fields": {"club_name": "Asian Kaleidoscope Month", "club_desc": "The Asian Kaleidoscope Month exists to: Celebrate the culture and history of Asian Americans Program a monthÆs worth of events Educate the Gainesville/University of Florida community and bring awareness to Asian American heritage Asian Kaleidoscope Month is the collective creation of a month-long celebration of culture and history of the Asian American community. It is an affiliate of the Asian American Student Union."}}, {"model": "members.club", "pk": 74, "fields": {"club_name": "Asian Public Relations Student Association", "club_desc": "The purpose of Asian Public Relations Student Association is to promote diverse experiences and voices within the UF College of Journalism and Communications by creating an inclusive, judgement-free zone to discuss the intersections of Asian-American culture and the public relations fields. Through this organization, we strive to create a community that empowers and strengthens the identity of our Asian, South Asian and Middle Eastern students, while giving them the resources to grow professionally in the..."}}, {"model": "members.club", "pk": 75, "fields": {"club_name": "Asian Student Pharmacists Coalition", "club_desc": "Asian Student Pharmacists Coalition (ASPC) encourages all student pharmacists, regardless of ethnic backgrounds, to become more knowledgeable about Asian and Asian American culture. It aims to provide a social and interactive foundation for Asian and Asian American students on campus to communicate and cooperate. Additionally, ASPC seeks to serve the local Asian community through patient care opportunities, while promoting inclusion and representation of Asian and Asian Americans."}}, {"model": "members.club", "pk": 76, "fields": {"club_name": "Assemble Ballet Company", "club_desc": "AssemblΘ Ballet Company is a student-run organization focused on improving ballet strength and technique. No audition or dress code required. All levels welcome. Come check us out!"}}, {"model": "members.club", "pk": 77, "fields": {"club_name": "Associated Builders and Contractors", "club_desc": "The purpose of Associated Builders and Contractors is to promote academic and career related opportunities within the construction industry. The ABC student chapter provides our members with hands on speaker series events from industry professionals and access to network outside the classroom and within the industry."}}, {"model": "members.club", "pk": 78, "fields": {"club_name": "Association for Computing Machinery", "club_desc": "University of FloridaÆs largest Pre-Professional Computer Science Community"}}, {"model": "members.club", "pk": 79, "fields": {"club_name": "Association for Law and Business", "club_desc": "The ALB is the premier student organization for the advancement of business law study at Levin College of Law. Members share an interest in all areas of business law, including Commercial Litigation, Securities, Corporate, Bankruptcy, and Intellectual Property law. Through its relationship with the Business Law Section of the Florida Bar, the ALB brings law students, professors, and practicing attorneys together by offering distinguished guest speakers, social events, and research and publication opportunities to the..."}}, {"model": "members.club", "pk": 80, "fields": {"club_name": "Association for Tax Law", "club_desc": "To involve and inform students on tax matters, to encourage students to volunteer at or participate in Volunteer Income Tax Assistance (VITA), an IRS sponsored program, and to involve students in tax competitions that may lead to participation on Tax Moot Court. The Association for Tax Law seeks to promote an awareness of tax matters and to involve students in academic competitions and volunteer activities."}}, {"model": "members.club", "pk": 81, "fields": {"club_name": "Association for Women in Mathematics", "club_desc": "placeholder"}}, {"model": "members.club", "pk": 82, "fields": {"club_name": "Association for Women in Sports Media", "club_desc": "The purpose of the Association for Women in Sports Media is to support the advancement and growth of women in sports media. The organization seeks to provide career-enhancing networking and mentorship opportunities."}}, {"model": "members.club", "pk": 83, "fields": {"club_name": "Association of Computer Engineers", "club_desc": "ACE plans, manages, and attends computer related projects, presentations, tutoring, mentoring, and special events hosted by the Computer & Information Science & Engineering (CISE) and the Electrical & Computer Engineering (ECE) Departments"}}, {"model": "members.club", "pk": 84, "fields": {"club_name": "Association of Latino Professionals in Finance and Accounting", "club_desc": "ALPFA creates opportunities, adds value, builds relationships for its members, the community and its business partners while expanding Latinx leadership in the global workforce."}}, {"model": "members.club", "pk": 85, "fields": {"club_name": "Association of Saudi Arabian Students", "club_desc": "The purpose of this organization if to serve as a means for welcoming Saudi Arabian students to the University of Florida in addition to fostering greater understanding and exposure to Saudi Arabian Culture."}}, {"model": "members.club", "pk": 86, "fields": {"club_name": "Association of Zamorano Alumni", "club_desc": "The purpose of the Association of Zamorano Alumni (AZA) is to promote academic and career resources to help students get involved in more extracurricular activities. Following the Zamorano University Pan-Americanism, AZA looks to involve Zamorano Alumni and other UF students in the organization in the exchange of culture, language, scientific experience and others. To promote the diversity, and follow the Pan-Americanism ideology of our organization, friends, colleagues and work partners will be encouraged to be..."}}, {"model": "members.club", "pk": 87, "fields": {"club_name": "Astraeus Student Organization", "club_desc": "ASO's objectives include enhancing space-related graduate student research, promoting advancement of space-related technologies, and to facilitate student activities involved in leadership, education, and other areas."}}, {"model": "members.club", "pk": 88, "fields": {"club_name": "Astronomy and Astrophysics Society", "club_desc": "To share the love of astronomy with everyone!"}}, {"model": "members.club", "pk": 89, "fields": {"club_name": "Athletic Training Student Association", "club_desc": "The Athletic Training Student Association is an undergraduate organization created to educate students while fostering a passion for the athletic training profession. The organization will provide educational opportunities, professional development, and networking with professionals and like-minded students."}}, {"model": "members.club", "pk": 90, "fields": {"club_name": "AutoGator", "club_desc": "The purpose of the Auto Gator club is to provide students at the University of Florida with a hands-on learning environment focused on automotive knowledge, maintenance, and safety. We aim to empower members with practical skills, from basic car care to advanced automotive techniques, while fostering a passion for cars and vehicle maintenance. Through workshops, events, and community outreach, the club strives to create a supportive space for car enthusiasts of all experience levels to..."}}, {"model": "members.club", "pk": 91, "fields": {"club_name": "Avigator Booster Club", "club_desc": "The purpose of the Avigator Booster Club is to create a student organization that supports the Air Force ROTC program at UF. With this support and the support of the Student Government, the organization will be able to more effectively operate and hold various events throughout the semester for our cadets to teach leadership skills, teamwork, and problem solving."}}, {"model": "members.club", "pk": 92, "fields": {"club_name": "Bachelor of Arts in Digital Arts and Sciences Society", "club_desc": "The Bachelors of Arts and Digital Arts and Sciences Society was created to bring together University of Florida students interested in or pursuing Digital Arts and Sciences. BADASS provides students a unique space to collaborate alongside multi-talented students with backgrounds in programming, writing, and gaming design. We specifically target DAS majors in the College of Engineering, Art, Journalism, and Computer Science majors. Non-major artists who also explore this emerging media of computer art, filmmaking, animation,..."}}, {"model": "members.club", "pk": 93, "fields": {"club_name": "BADAS Mentorship Program", "club_desc": "Mission Statement"}}, {"model": "members.club", "pk": 94, "fields": {"club_name": "Baha'i Association", "club_desc": "The purpose of the Baha'i Association is to foster relationships with like-minded groups and individuals who are interested in benefiting the University of Florida as well as society. We hope to instill a sense of unity that overcomes cultural, religious, and ideological barriers. Members of the Baha'i Association believe the best way to better themselves is by service to other members of the community."}}, {"model": "members.club", "pk": 95, "fields": {"club_name": "Baking4Wellness", "club_desc": "Baking 4 Wellness is an organization that promotes mental and general health awareness to the community through the art of baking. Members will have the opportunity to learn the basics of baking and apply that knowledge via fundraising and philanthropy. Members will be able to participate through workshops, general body meetings, social events, and more. We would also like to teach students how to incorporate fruits and vegetables into baking to promote general wellness. Workshops..."}}, {"model": "members.club", "pk": 96, "fields": {"club_name": "Balanced Living in Stem", "club_desc": "At BLIS, our mission is to support and empower STEM students in their journey towards academic success while keeping a balanced lifestyle. We provide a space for STEM students to engage in meaningful conversations, share experiences, and build a supportive network. We believe in the importance of a consistent routine that harmonizes self-care and strive to elevate its priority within the demanding academic landscape.To achieve these objectives, we organize a variety of events, including healthy..."}}, {"model": "members.club", "pk": 97, "fields": {"club_name": "Balkan Student Association", "club_desc": "The Balkan Student Association shall unify the various Balkan nationalities represented on campus by creating a safe space for Balkan students and representing their interests at the University of Florida. The goal of this organization is to celebrate the Balkan heritage by organizing cultural events, maintaining fluency of the languages, and presenting our culture to our non-Balkan peers and Gainesville community."}}, {"model": "members.club", "pk": 98, "fields": {"club_name": "Bangladeshi Students' Association", "club_desc": "a) To provide an organization for those affiliated with or interested in the Bangladeshi culture to meet and celebrate the language and customs of Bangladesh. b) To raise money for charities that improve the quality of life of people in Bangladesh, including, but not limited to, nonprofit organizations that support education, health, and economic development in Bangladesh. c) To promote awareness and appreciation of Bangladesh in the..."}}, {"model": "members.club", "pk": 99, "fields": {"club_name": "BAPS Campus Fellowship", "club_desc": "The purpose of the organization shall be to unite students on University of FloridaÆs campus and provide opportunities to learn about Hindu heritage and culture."}}, {"model": "members.club", "pk": 100, "fields": {"club_name": "Baptist Collegiate Ministries", "club_desc": "Our organization's goal is to share our faith with fellow students and do so with respect. We intend to cultivate Christian leaders for tomorrow that live their lives with integrity, honesty, and character. With these traits in mind, we aim to better our community through our organization."}}, {"model": "members.club", "pk": 101, "fields": {"club_name": "Best Buddies", "club_desc": "Best Buddies International is a nonprofit 501(c)(3) organization dedicated to establishing a global volunteer movement that creates opportunities for one-to-one friendships, integrated employment and leadership development for people with intellectual and developmental disabilities (IDD)."}}, {"model": "members.club", "pk": 102, "fields": {"club_name": "Beta Alpha Psi", "club_desc": "Beta Alpha Psi is an esteemed, national honor society for students and professionals in financial information fields. Our primary objective is to encourage and recognize scholastic and professional excellence in accounting, finance, and information systems. We promote the study and practice of these disciplines, offering members opportunities for self-development, service, and networking with practicing professionals. We also foster a strong sense of ethical, social, and public responsibility. With 115 chapters nationwide, Beta Alpha Psi continues..."}}, {"model": "members.club", "pk": 103, "fields": {"club_name": "BETA CHI THETA", "club_desc": "The purpose of Beta Theta is to assemble motivated young men to uphold the six founding pillars by which it stands"}}, {"model": "members.club", "pk": 104, "fields": {"club_name": "Beta Iota Chapter of the Alpha Chi Sigma Fraternity", "club_desc": "The purpose of Alpha Chi Sigma shall be to promote the awareness of chemistry through education and charitable means, as reflected in the Three Objects of the Fraternity, which are: 1. To bind its members with a tie of true and lasting friendship. 2. To strive for the advancement of chemistry both as a science and as a profession. 3. To aid its members by every honorable means in the attainment of their ambitions as chemists throughout their mortal..."}}, {"model": "members.club", "pk": 105, "fields": {"club_name": "BETA THETA PI", "club_desc": "To Develop Men of Principle for a Principled Life."}}, {"model": "members.club", "pk": 106, "fields": {"club_name": "Beth Miller Demonstration Team", "club_desc": "The purpose and mission of this organization will be to perform in various parades and special drill performances in the state of Florida and the Southeastern United States. The organization will act as an opportunity for civilians to become involved in military traditions and customs without acting as an official representation of the United States military in any capacity. It may also compete at national drill competitions, while establishing and providing an environment of cooperation..."}}, {"model": "members.club", "pk": 107, "fields": {"club_name": "Big Sister Little Sister Mentoring Program", "club_desc": "1) To promote and advocate for the uplifting of ALL women globally in the organization, on and off collegiate campuses, in the workplace and in communities. 2) To provide fellowship among all women regardless of age, race, religion, creed, economic status, personal doctrines and or beliefs. 3) To provide community service, networking, social, leadership, and growth opportunities for all women. 4) To provide mentorship for women, offering sound advice to each member. BSLS strives to..."}}, {"model": "members.club", "pk": 108, "fields": {"club_name": "Biomedical Engineering Graduate Student Council", "club_desc": "The purpose of Biomedical Engineering Graduate Student Council is to 1) provide an agency for the coordination of biomedical engineering student activities to promote common goals and interests of the BME graduate student body, 2) advance and enrich the academic and educational experience of graduate students in the UF BME Department, and 3) seek the improvement of BME graduate student education through active communication and representation between BME students and faculty, and other governing bodies..."}}, {"model": "members.club", "pk": 109, "fields": {"club_name": "Biomedical Engineering Inclusive Excellence Committee", "club_desc": "Our goal is to promote inclusivity by advancing education and honoring a variety of perspectives while fostering respect and community of scientists of various backgrounds. In doing so, we aim to establish a secure environment to address concerns like discrimination through the dissemination of knowledge across various scientific disciplines."}}, {"model": "members.club", "pk": 110, "fields": {"club_name": "Biomedical Engineering Society", "club_desc": "The Biomedical Engineering Society strives to create a supportive environment that fosters student exploration and advancement in the field of biomedical engineering. We are dedicated to promoting excellence by providing students with the resources and support they need to achieve success in their academic and career endeavors."}}, {"model": "members.club", "pk": 111, "fields": {"club_name": "Biostatistics", "club_desc": "The Biostatistics Club is dedicated to fostering a community of students passionate about the field of biostatistics. Our purpose is to enhance understanding and application of biostatistical methods through collaborative learning, interactive workshops, and engagement in research activities. We aim to provide a platform for members to develop their analytical skills, share knowledge, and network with peers and professionals in the field."}}, {"model": "members.club", "pk": 112, "fields": {"club_name": "Black Graduate Student Organization", "club_desc": "The Black Graduate Student Organization (BGSO) is an interdisciplinary, multi-ethnic organization that is dedicated to identifying and addressing the needs of graduate and professional students of African, African American, or Afro Caribbean descent at the University of Florida. Founded in 1975 with a rich tradition deeply rooted in advocacy, BGSO aims to enhance the graduate experience of its members by offering academic and professional support, providing opportunities for community outreach and service, in addition to..."}}, {"model": "members.club", "pk": 113, "fields": {"club_name": "Black Public Relations Student Society", "club_desc": "The purpose of BPRSS is to advance the practice of Black public relations as a marketing discipline; to serve as the voice for students of color who will soon be working in the black communications field nationwide; to empower its members through support, resources and education; and to offer guidance and assistance to students pursuing careers in the field. In doing this, it will promote diversity and inclusion by creating an environment where members feel like they belong."}}, {"model": "members.club", "pk": 114, "fields": {"club_name": "Black Student Advocacy Group", "club_desc": "The Black Student Advocacy Group serves multiple purposes within the College of Dentistry. BSAG aims to - ╖ Create a safe space for Black students to thrive and feel validated ╖ Provide opportunities for fellowship, camaraderie and mentorship ╖ Advocate for more Black representation in both the UFCD student and faculty population ╖ ..."}}, {"model": "members.club", "pk": 115, "fields": {"club_name": "Black Student Assembly", "club_desc": "The purpose of the Black Student Assembly is to promote and highlight the culture of black excellence here at the University of Florida."}}, {"model": "members.club", "pk": 116, "fields": {"club_name": "Black Student Union", "club_desc": "The purpose of the Black Student Union is to promote educate and exemplify the rich cultural heritage and unique diversity of the people of the African Diaspora. We accomplish this by creating leaders, cultivating success, and challenging each other."}}, {"model": "members.club", "pk": 117, "fields": {"club_name": "Black Students in Business", "club_desc": "Black Students in Business serves to establish a community of excellent Black students within the Warrington College of Business at the University of Florida. This organization will host numerous professional and social events curated specifically for the enrichment of our Black business community."}}, {"model": "members.club", "pk": 118, "fields": {"club_name": "Black Women Leaders in Law", "club_desc": "Black Women Leaders in Law strives to uplift and support Black Women scholars pursuing a profession in the legal field while fostering an inclusive community of driven Black Women. (BWLL) works to assist and prepare Black Women for the legal world by equipping them with professionalism skills, knowledge, and an unyielding passion for justice. With Black Women being underrepresented in the Legal Field, (BWLL) combats this through mentorship, community outreach, and advocating for underserved and..."}}, {"model": "members.club", "pk": 119, "fields": {"club_name": "Block and Bridle Club", "club_desc": "Block & Bridle is a professional student organization dedicated to promoting the interest and scholarship of animal sciences and agriculture. Here at UF, this means promoting the further education of our members in agriculture through leadership, service, and community."}}, {"model": "members.club", "pk": 120, "fields": {"club_name": "Blockchain Club", "club_desc": "The Blockchain Club is a group that aims to help folks understand and join the blockchain community. We're here to make the concept of blockchain easy to grasp and encourage participation."}}, {"model": "members.club", "pk": 121, "fields": {"club_name": "Blue Solutions", "club_desc": "This mission is to empower undergraduate students passionate in environmental and Marine studies to make active contributions within local campus communities. The non-profit parent organization, Oyster Boys Conservation, LLC, aims to equip young adults to lead within their communities, educate their peers, create a sustainable impact, and become their own environmental leaders."}}, {"model": "members.club", "pk": 122, "fields": {"club_name": "Central American Latin Organization", "club_desc": "CALOR aims to serve as a space of empowerment and visibility for students interested in or who identify with Central American culture at the University of Florida. We welcome people from all backgrounds to learn about Central America through educational and cultural events."}}, {"model": "members.club", "pk": 123, "fields": {"club_name": "Century Tower Investments", "club_desc": "Century Tower Investments primary purpose is to provide students with finance experience through understanding Macro and Micro economic factors as well as the process for evaluating, assessing, and executing stock trades in a virtual environment. Century Tower Investments will host GBMÆs, workshops, and networking opportunities."}}, {"model": "members.club", "pk": 124, "fields": {"club_name": "Changing Health, Attitudes, and Actions to Recreate Girls", "club_desc": "Changing Health, Attitudes, and Actions to Recreate girls, or CHAARG for short, is a womenÆs health and wellness organization that strives to create a supportive community for women to enjoy fitness with friends! We partner with local studios around Gainesville and other organizations to try different kinds of workouts; we also have casual socials and small groups where members can enjoy a break from school and get to know each other. UFL CHAARG is for..."}}, {"model": "members.club", "pk": 125, "fields": {"club_name": "Chemical Engineering Peer Advisors", "club_desc": "The purpose of ChEPA is to strive to enhance the personal, professional and academic development of current and prospective chemical engineering students; to connect students to the resources that can guide them on their paths to success through comprehensive group and individual advising; and to help students have a positive and successful learning experience at the University of Florida, under the supervision of Dmitry Kopelevich, the Undergraduate Coordinator."}}, {"model": "members.club", "pk": 126, "fields": {"club_name": "Chi Epsilon", "club_desc": "Dedicated to the purpose of maintaining and promoting the status of civil and environmental engineering as an ideal profession, Chi Epsilon was organized to recognize the characteristics of the individual civil and environmental en- gineer deemed to be fundamental to the successful pursuit of an engineering career, and to aid in the development of those characteristics in the civil and environmental engineering student."}}, {"model": "members.club", "pk": 127, "fields": {"club_name": "CHI OMEGA", "club_desc": "Chi Omega is an intergenerational womenÆs organization forever committed to our founding purposes:"}}, {"model": "members.club", "pk": 128, "fields": {"club_name": "CHI PHI", "club_desc": "Dating back to 1824, Chi Phi has long striven to and succeeded in building young men who embody our core values of 'Truth, Honor, and Personal Integrity.' The Theta Delta Chapter of Chi Phi at the University of Florida embraces these values through our mission of building lifelong friendships, embracing leadership opportunities both within and outside of the organization, and developing men who exemplify good character."}}, {"model": "members.club", "pk": 129, "fields": {"club_name": "Chi Sigma Iota Beta chapter", "club_desc": "The purpose of Chi Sigma Iota Beta Chapter is to contribute to the Counselor Education field by creating awareness, promoting collaboration, and supporting both educational and personal development within the counseling community."}}, {"model": "members.club", "pk": 130, "fields": {"club_name": "Children Beyond Our Borders", "club_desc": "The UF Chapter of Children Beyond Our Borders was founded in 2003 and is affiliated with the non-profit organization Children Beyond Our Borders that is dedicated to eliminating barriers to education and providing a foundation for quality of life improvements for vulnerable children at home and in Latin America. The ultimate goal of The UF Chapter of CBOB is to raise awareness on campus and throughout Gainesville regarding the education and healthcare gap for children..."}}, {"model": "members.club", "pk": 131, "fields": {"club_name": "Children's Future Association", "club_desc": "ChildrenÆs Future is dedicated to giving back to local children in Gainesville by partnering with several neighboring philanthropic organizations. Our primary goal is to establish a mentorship program that pairs these children with University of Florida (UF) students. We aim to create fun and interactive experiences through various events and activities, providing opportunities for UF students to engage with the local youth. Our core values are respect, sincerity, community, and growth. This initiative seeks to..."}}, {"model": "members.club", "pk": 132, "fields": {"club_name": "Chinese American Student Association", "club_desc": 
